tiss/xsd/tissRecursoGlosaV3_02_02.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?>
<definitions xmlns:tns="http://www.ans.gov.br/tiss/ws/tipos/tissrecursoglosa/v30202" xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="tissRecursoGlosa" targetNamespace="http://www.ans.gov.br/tiss/ws/tipos/tissrecursoglosa/v30202">
	<types>
		<schema xmlns:soap11-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://www.w3.org/2001/XMLSchema">
			<import namespace="http://www.ans.gov.br/padroes/tiss/schemas" schemaLocation="tissWebServicesV3_02_02.xsd"/>
		</schema>
	</types>
	<message name="tissRecursoGlosa_Request">
		<part name="recursoGlosa" element="ans:loteRecursoGlosaWS"/>
	</message>
	<message name="tissRecursoGlosa_Response">
		<part name="reciboRecursoGlosa" element="ans:protocoloRecebimentoRecursoWS"/>
	</message>
	<message name="tissFault">
		<part name="tissFault" element="ans:tissFaultWS"/>
	</message>
	<portType name="tissRecursoGlosa_PortType">
		<operation name="tissRecursoGlosa_Operation">
			<input message="tns:tissRecursoGlosa_Request"/>
			<output message="tns:tissRecursoGlosa_Response"/>
			<fault name="TissFault" message="tns:tissFault"/>
		</operation>
	</portType>
	<binding name="tissRecursoGlosa_Binding" type="tns:tissRecursoGlosa_PortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="tissRecursoGlosa_Operation">
			<soap:operation soapAction=""/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
			<fault name="TissFault">
				<soap:fault name="TissFault" use="literal"/>
			</fault>
		</operation>
	</binding>
	<service name="tissRecursoGlosa">
		<port name="tissRecursoGlosa_Port" binding="tns:tissRecursoGlosa_Binding">
			<soap:address/>
		</port>
	</service>
</definitions>
